tiborsimon/embedded-tdd-headers/pic/8bit/pic18f64j90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F64J90_H_
#define _PIC18F64J90_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define ADDEN2                        9
#define RCSTA2_ADDEN                  10
#define RCSTA2_CREN                   11
#define CREN2                         12
#define SREN2                         13
#define RCSTA2_SREN                   14
#define RC92                          15
#define RCSTA2_nRC8                   16
#define RC8_92                        17
#define RCSTA2_RX9                    18
#define RCSTA2_NOT_RC8                19
#define RCSTA2_RC9                    20
#define RCSTA2_RC8_9                  21
#define RX92                          22
#define RCSTA2_SPEN                   23
#define SPEN2                         24
#define TXSTA2                        25
#define TXSTA2_TXD8                   26
#define TX9D2                         27
#define TXSTA2_TX9D                   28
#define TXD82                         29
#define TRMT2                         30
#define TXSTA2_TRMT                   31
#define BRGH2                         32
#define TXSTA2_BRGH                   33
#define SENDB2                        34
#define TXSTA2_SYNC                   35
#define SYNC2                         36
#define TXEN2                         37
#define TXSTA2_TXEN                   38
#define TX8_92                        39
#define TX92                          40
#define TXSTA2_TX9                    41
#define TXSTA2_nTX8                   42
#define TXSTA2_NOT_TX8                43
#define TXSTA2_TX8_9                  44
#define TXSTA2_CSRC                   45
#define CSRC2                         46
#define CCP2CON                       47
#define CCP2M                         48
#define CCP2M0                        49
#define CCP2M1                        50
#define CCP2M2                        51
#define CCP2M3                        52
#define DC2B0                         53
#define DCCP2Y                        54
#define DC2B                          55
#define DC2B1                         56
#define DCCP2X                        57
#define CCP1CON                       58
#define CCP1M0                        59
#define CCP1M                         60
#define CCP1M1                        61
#define CCP1M2                        62
#define CCP1M3                        63
#define DCCP1Y                        64
#define DC1B                          65
#define DC1B0                         66
#define DCCP1X                        67
#define DC1B1                         68
#define SEG0COM1                      69
#define LCDDATA6                      70
#define S00C1                         71
#define S0C1                          72
#define S01C1                         73
#define SEG1COM1                      74
#define S1C1                          75
#define S02C1                         76
#define S2C1                          77
#define SEG2COM1                      78
#define S03C1                         79
#define SEG3COM1                      80
#define S3C1                          81
#define SEG4COM1                      82
#define S4C1                          83
#define S04C1                         84
#define S5C1                          85
#define S05C1                         86
#define SEG5COM1                      87
#define SEG6COM1                      88
#define S6C1                          89
#define S06C1                         90
#define SEG7COM1                      91
#define S7C1                          92
#define S07C1                         93
#define LCDDATA7                      94
#define S08C1                         95
#define S8C1                          96
#define SEG8COM1                      97
#define SEG9COM1                      98
#define S09C1                         99
#define S9C1                          100
#define S10C1                         101
#define SEG10COM1                     102
#define S11C1                         103
#define SEG11COM1                     104
#define S12C1                         105
#define SEG12COM1                     106
#define S13C1                         107
#define SEG13COM1                     108
#define S14C1                         109
#define SEG14COM1                     110
#define SEG15COM1                     111
#define S15C1                         112
#define SEG16COM1                     113
#define LCDDATA8                      114
#define S16C1                         115
#define SEG17COM1                     116
#define S17C1                         117
#define SEG18COM1                     118
#define S18C1                         119
#define S19C1                         120
#define SEG19COM1                     121
#define S20C1                         122
#define SEG20COM1                     123
#define S21C1                         124
#define SEG21COM1                     125
#define SEG22COM1                     126
#define S22C1                         127
#define S23C1                         128
#define SEG23COM1                     129
#define S24C1                         130
#define SEG24COM1                     131
#define LCDDATA9                      132
#define S25C1                         133
#define SEG25COM1                     134
#define S26C1                         135
#define SEG26COM1                     136
#define SEG27COM1                     137
#define S27C1                         138
#define SEG28COM1                     139
#define S28C1                         140
#define SEG29COM1                     141
#define S29C1                         142
#define SEG30COM1                     143
#define S30C1                         144
#define S31C1                         145
#define SEG31COM1                     146
#define S32C1                         147
#define SEG32COM1                     148
#define LCDDATA10                     149
#define SEG0COM2                      150
#define SSPM012                       151
#define LCDDATA12                     152
#define S00C2                         153
#define S0C2                          154
#define S01C2                         155
#define SSPM112                       156
#define SEG1COM2                      157
#define S1C2                          158
#define S02C2                         159
#define S2C2                          160
#define SEG2COM2                      161
#define SSPM212                       162
#define S03C2                         163
#define SEG3COM2                      164
#define S3C2                          165
#define SSPM312                       166
#define SEG4COM2                      167
#define S4C2                          168
#define S04C2                         169
#define S5C2                          170
#define S05C2                         171
#define SEG5COM2                      172
#define SEG6COM2                      173
#define S6C2                          174
#define S06C2                         175
#define SEG7COM2                      176
#define S7C2                          177
#define S07C2                         178
#define LCDDATA13                     179
#define S08C2                         180
#define S8C2                          181
#define SEG8COM2                      182
#define SEG9COM2                      183
#define S09C2                         184
#define S9C2                          185
#define S10C2                         186
#define SEG10COM2                     187
#define SEG11COM2                     188
#define S11C2                         189
#define S12C2                         190
#define SEG12COM2                     191
#define S13C2                         192
#define SEG13COM2                     193
#define S14C2                         194
#define SEG14COM2                     195
#define S15C2                         196
#define SEG15COM2                     197
#define SEG16COM2                     198
#define S16C2                         199
#define LCDDATA14_MSK0                200
#define LCDDATA14                     201
#define S17C2                         202
#define LCDDATA14_MSK1                203
#define SEG17COM2                     204
#define LCDDATA14_MSK2                205
#define S18C2                         206
#define SEG18COM2                     207
#define S19C2                         208
#define SEG19COM2                     209
#define LCDDATA14_MSK3                210
#define LCDDATA14_MSK4                211
#define S20C2                         212
#define SEG20COM2                     213
#define LCDDATA14_MSK5                214
#define S21C2                         215
#define SEG21COM2                     216
#define SEG22COM2                     217
#define LCDDATA14_MSK6                218
#define S22C2                         219
#define LCDDATA14_MSK7                220
#define SEG23COM2                     221
#define S23C2                         222
#define LCDDATA15                     223
#define S24C2                         224
#define SEG24COM2                     225
#define S25C2                         226
#define SEG25COM2                     227
#define S26C2                         228
#define SEG26COM2                     229
#define SEG27COM2                     230
#define S27C2                         231
#define S28C2                         232
#define SEG28COM2                     233
#define SEG29COM2                     234
#define S29C2                         235
#define SEG30COM2                     236
#define S30C2                         237
#define SEG31COM2                     238
#define S31C2                         239
#define LCDDATA16                     240
#define S32C2                         241
#define SEG32COM2                     242
#define T4CKPS016                     243
#define T4CKPS116                     244
#define T4OUTPS016                    245
#define T4OUTPS116                    246
#define T4OUTPS216                    247
#define T4OUTPS316                    248
#define SEG0COM3                      249
#define LCDDATA18                     250
#define S00C3                         251
#define S0C3                          252
#define S01C3                         253
#define SEG1COM3                      254
#define S1C3                          255
#define S02C3                         256
#define S2C3                          257
#define SEG2COM3                      258
#define S03C3                         259
#define SEG3COM3                      260
#define S3C3                          261
#define SEG4COM3                      262
#define S4C3                          263
#define S04C3                         264
#define S5C3                          265
#define S05C3                         266
#define SEG5COM3                      267
#define SEG6COM3                      268
#define S6C3                          269
#define S06C3                         270
#define SEG7COM3                      271
#define S7C3                          272
#define S07C3                         273
#define S8C3                          274
#define SEG8COM3                      275
#define S08C3                         276
#define LCDDATA19                     277
#define S9C3                          278
#define SEG9COM3                      279
#define S09C3                         280
#define SEG10COM3                     281
#define S10C3                         282
#define S11C3                         283
#define SEG11COM3                     284
#define S12C3                         285
#define T3CKPS019                     286
#define SEG12COM3                     287
#define S13C3                         288
#define SEG13COM3                     289
#define T3CKPS119                     290
#define S14C3                         291
#define SEG14COM3                     292
#define TMR3CS019                     293
#define SEG15COM3                     294
#define S15C3                         295
#define TMR3CS119                     296
#define LCDDATA20                     297
#define S16C3                         298
#define SEG16COM3                     299
#define SEG17COM3                     300
#define S17C3                         301
#define SEG18COM3                     302
#define S18C3                         303
#define S19C3                         304
#define SEG19COM3                     305
#define S20C3                         306
#define SEG20COM3                     307
#define SEG21COM3                     308
#define S21C3                         309
#define SEG22COM3                     310
#define S22C3                         311
#define S23C3                         312
#define SEG23COM3                     313
#define S24C3                         314
#define LCDDATA21                     315
#define SEG24COM3                     316
#define S25C3                         317
#define SEG25COM3                     318
#define S26C3                         319
#define SEG26COM3                     320
#define SEG27COM3                     321
#define S27C3                         322
#define SEG28COM3                     323
#define S28C3                         324
#define SEG29COM3                     325
#define S29C3                         326
#define SEG30COM3                     327
#define S30C3                         328
#define SEG31COM3                     329
#define S31C3                         330
#define LCDDATA22                     331
#define S32C3                         332
#define SEG32COM3                     333
#define BAUDCON1                      334
#define ABDEN                         335
#define ABDEN1                        336
#define WUE1                          337
#define WUE                           338
#define BRG16                         339
#define BRG161                        340
#define TXCKP                         341
#define SCKP                          342
#define TXCKP1                        343
#define SCKP1                         344
#define CKTXP                         345
#define DTRXP1                        346
#define RXDTP1                        347
#define RXDTP                         348
#define DTRXP                         349
#define RCIDL1                        350
#define RCMT                          351
#define RCMT1                         352
#define RCIDL                         353
#define ABDOVF                        354
#define ABDOVF1                       355
#define PORTA                         356
#define AN0                           357
#define ULPWUIN                       358
#define PORTA_RA0                     359
#define SEG18                         360
#define AN1                           361
#define PORTA_RA1                     362
#define AN2                           363
#define PORTA_RA2                     364
#define VREFM                         365
#define AN3                           366
#define PORTA_RA3                     367
#define VREFP                         368
#define PORTA_RA4                     369
#define SEG14                         370
#define T0CKI                         371
#define SEG15                         372
#define AN4                           373
#define PORTA_RA5                     374
#define LVDIN                         375
#define CLKO                          376
#define PORTA_RA6                     377
#define OSC2                          378
#define CLKI                          379
#define PORTA_RA7                     380
#define OSC1                          381
#define RJPU                          382
#define PORTB                         383
#define SEG30                         384
#define INT0                          385
#define PORTB_RB0                     386
#define INT1                          387
#define SEG8                          388
#define PORTB_RB1                     389
#define INT2                          390
#define SEG9                          391
#define PORTB_RB2                     392
#define SEG10                         393
#define INT3                          394
#define CCP2_PA2                      395
#define PORTB_RB3                     396
#define SEG11                         397
#define KBI0                          398
#define PORTB_RB4                     399
#define SEG29                         400
#define KBI1                          401
#define PORTB_RB5                     402
#define PGC                           403
#define KBI2                          404
#define PORTB_RB6                     405
#define PGD                           406
#define KBI3                          407
#define PORTB_RB7                     408
#define PORTC                         409
#define T13CKI                        410
#define T1OSO                         411
#define PORTC_RC0                     412
#define SEG32                         413
#define PORTC_CCP2                    414
#define T1OSI                         415
#define PORTC_RC1                     416
#define PA2                           417
#define SEG13                         418
#define CCP1                          419
#define PA1                           420
#define PORTC_RC2                     421
#define SEG17                         422
#define SCL                           423
#define SCK                           424
#define PORTC_RC3                     425
#define SEG16                         426
#define SDA                           427
#define SDI                           428
#define PORTC_RC4                     429
#define SEG12                         430
#define SDO                           431
#define PORTC_RC5                     432
#define SEG27                         433
#define PORTC_RC6                     434
#define TX1                           435
#define CK1                           436
#define RX1                           437
#define SEG28                         438
#define DT1                           439
#define PORTC_RC7                     440
#define PORTD                         441
#define SEG0                          442
#define PORTD_RD0                     443
#define PORTD_RD1                     444
#define SEG1                          445
#define PORTD_RD2                     446
#define SEG2                          447
#define PORTD_RD3                     448
#define SEG3                          449
#define SEG4                          450
#define PORTD_RD4                     451
#define SEG5                          452
#define PORTD_RD5                     453
#define SEG6                          454
#define PORTD_RD6                     455
#define PORTD_RD7                     456
#define SEG7                          457
#define SS2                           458
#define PORTE                         459
#define PD2                           460
#define RDE                           461
#define PORTE_RE0                     462
#define LCDBIAS1                      463
#define WRE                           464
#define PORTE_RE1                     465
#define LCDBIAS2                      466
#define PC2                           467
#define COM0                          468
#define CCP9E                         469
#define PORTE_RE3                     470
#define PC3E                          471
#define PB3E                          472
#define COM1                          473
#define PORTE_RE4                     474
#define CCP8E                         475
#define COM2                          476
#define CCP7E                         477
#define PORTE_RE5                     478
#define PC1E                          479
#define CCP6E                         480
#define COM3                          481
#define PORTE_RE6                     482
#define PB1E                          483
#define PORTE_CCP2                    484
#define CCP2E                         485
#define SEG31                         486
#define PA2E                          487
#define PORTE_RE7                     488
#define PORTF                         489
#define PORTF_RF1                     490
#define SEG19                         491
#define C2OUTF                        492
#define AN6                           493
#define PORTF_C2OUT                   494
#define AN7                           495
#define C1OUTF                        496
#define PORTF_C1OUT                   497
#define SEG20                         498
#define PORTF_RF2                     499
#define PORTF_RF3                     500
#define AN8                           501
#define SEG21                         502
#define C2INB                         503
#define PORTF_RF4                     504
#define AN9                           505
#define SEG22                         506
#define C2INA                         507
#define C1INB                         508
#define PORTF_RF5                     509
#define SEG23                         510
#define CVREF                         511
#define AN10                          512
#define C1INA                         513
#define PORTF_RF6                     514
#define SEG24                         515
#define AN11                          516
#define PORTF_RF7                     517
#define SS1                           518
#define AN5                           519
#define SEG25                         520
#define PORTG                         521
