tiborsimon/embedded-tdd-headers/pic/8bit/pic18f64j90_tdd.h
#define S15C0                         1091
#define LCDDATA2                      1092
#define S16C0                         1093
#define SEG16COM0                     1094
#define SEG17COM0                     1095
#define S17C0                         1096
#define SEG18COM0                     1097
#define S18C0                         1098
#define S19C0                         1099
#define SEG19COM0                     1100
#define S20C0                         1101
#define SEG20COM0                     1102
#define S21C0                         1103
#define SEG21COM0                     1104
#define SEG22COM0                     1105
#define S22C0                         1106
#define S23C0                         1107
#define SEG23COM0                     1108
#define LCDDATA3                      1109
#define S24C0                         1110
#define SEG24COM0                     1111
#define S25C0                         1112
#define SEG25COM0                     1113
#define S26C0                         1114
#define SEG26COM0                     1115
#define SEG27COM0                     1116
#define S27C0                         1117
#define SEG28COM0                     1118
#define S28C0                         1119
#define SEG29COM0                     1120
#define S29C0                         1121
#define S30C0                         1122
#define SEG30COM0                     1123
#define SEG31COM0                     1124
#define S31C0                         1125
#define S32C0                         1126
#define SEG32COM0                     1127
#define LCDDATA4                      1128
#define ADCON2                        1129
#define ADCS0                         1130
#define ADCS                          1131
#define ADCS1                         1132
#define ADCS2                         1133
#define ACQT0                         1134
#define ACQT                          1135
#define ACQT1                         1136
#define ACQT2                         1137
#define ADFM                          1138
#define ADCON1                        1139
#define PCFG0                         1140
#define PCFG                          1141
#define PCFG1                         1142
#define PCFG2                         1143
#define CHSN3                         1144
#define PCFG3                         1145
#define VCFG                          1146
#define VCFG0                         1147
#define VCFG01                        1148
#define VCFG11                        1149
#define VCFG1                         1150
#define ADCON0                        1151
#define ADON                          1152
#define nDONE                         1153
#define GO_nDONE                      1154
#define NOT_DONE                      1155
#define GODONE                        1156
#define GO_DONE                       1157
#define DONE                          1158
#define GO                            1159
#define GO_NOT_DONE                   1160
#define CHS                           1161
#define CHS0                          1162
#define CHS1                          1163
#define CHS2                          1164
#define CHS3                          1165
#define ADCAL                         1166
#define SSPCON2                       1167
#define SEN1                          1168
#define SEN                           1169
#define ADMSK11                       1170
#define RSEN1                         1171
#define RSEN                          1172
#define ADMSK1                        1173
#define PEN                           1174
#define ADMSK21                       1175
#define PEN1                          1176
#define ADMSK2                        1177
#define ADMSK31                       1178
#define RCEN                          1179
#define RCEN1                         1180
#define ADMSK3                        1181
#define ACKEN                         1182
#define ACKEN1                        1183
#define ADMSK41                       1184
#define ADMSK4                        1185
#define ACKDT1                        1186
#define ADMSK51                       1187
#define ADMSK5                        1188
#define ACKDT                         1189
#define ACKSTAT                       1190
#define ACKSTAT1                      1191
#define GCEN                          1192
#define GCEN1                         1193
#define SSPCON1                       1194
#define SSPM0                         1195
#define SSPM                          1196
#define SSPM01                        1197
#define SSPM1                         1198
#define SSPM11                        1199
#define SSPM2                         1200
#define SSPM21                        1201
#define SSPM31                        1202
#define SSPM3                         1203
#define CKP                           1204
#define CKP1                          1205
#define SSPEN                         1206
#define SSPEN1                        1207
#define SSPOV1                        1208
#define SSPOV                         1209
#define WCOL1                         1210
#define WCOL                          1211
#define SSPSTAT                       1212
#define BF                            1213
#define BF1                           1214
#define UA1                           1215
#define UA                            1216
#define R_NOT_W                       1217
#define READ_WRITE                    1218
#define RW1                           1219
#define NOT_W                         1220
#define I2C_READ                      1221
#define nW                            1222
#define RW                            1223
#define nWRITE                        1224
#define R                             1225
#define NOT_WRITE                     1226
#define R_nW                          1227
#define R_W                           1228
#define START                         1229
#define START1                        1230
#define S                             1231
#define I2C_START                     1232
#define STOP                          1233
#define STOP1                         1234
#define I2C_STOP                      1235
#define P                             1236
#define NOT_A                         1237
#define nA                            1238
#define D_A                           1239
#define D_nA                          1240
#define D                             1241
#define DA1                           1242
#define DA                            1243
#define DATA_ADDRESS                  1244
#define D_NOT_A                       1245
#define NOT_ADDRESS                   1246
#define nADDRESS                      1247
#define I2C_DAT                       1248
#define CKE                           1249
#define CKE1                          1250
#define SMP                           1251
#define SMP1                          1252
#define SSPADD                        1253
#define SSPADD_MSK0                   1254
#define MSK01                         1255
#define MSK11                         1256
#define SSPADD_MSK1                   1257
#define MSK21                         1258
#define SSPADD_MSK2                   1259
#define MSK31                         1260
#define SSPADD_MSK3                   1261
#define SSPADD_MSK4                   1262
#define MSK41                         1263
#define MSK51                         1264
#define SSPADD_MSK5                   1265
#define SSPADD_MSK6                   1266
#define MSK61                         1267
#define MSK71                         1268
#define SSPADD_MSK7                   1269
#define T2CON                         1270
#define T2CKPS0                       1271
#define T2CKPS                        1272
#define T2CKPS1                       1273
#define TMR2ON                        1274
#define T2OUTPS0                      1275
#define T2OUTPS                       1276
#define T2OUTPS1                      1277
#define T2OUTPS2                      1278
#define T2OUTPS3                      1279
#define PR2                           1280
#define WM0                           1281
#define WM1                           1282
#define WAIT0                         1283
#define WAIT1                         1284
#define EBDIS                         1285
#define T1CON                         1286
#define TMR1ON                        1287
#define TMR1CS                        1288
#define NOT_T1SYNC                    1289
#define T1SYNC                        1290
#define nT1SYNC                       1291
#define T1INSYNC                      1292
#define T1OSCEN                       1293
#define SOSCEN                        1294
#define T1CKPS0                       1295
#define T1CKPS                        1296
#define T1CKPS1                       1297
#define T1RUN                         1298
#define T1RD16                        1299
#define T1CON_RD16                    1300
#define RCON                          1301
#define BOR                           1302
#define NOT_BOR                       1303
#define nBOR                          1304
#define POR                           1305
#define nPOR                          1306
#define NOT_POR                       1307
#define PD                            1308
#define nPD                           1309
#define NOT_PD                        1310
#define nTO                           1311
#define TO                            1312
#define NOT_TO                        1313
#define nRI                           1314
#define NOT_RI                        1315
#define RI                            1316
#define NOT_CM                        1317
#define RCON_CM                       1318
#define nCM                           1319
#define IPEN                          1320
#define WDTCON                        1321
#define SWDTE                         1322
#define SWDTEN                        1323
#define REGSLP                        1324
#define LCDREG                        1325
#define CKSEL0                        1326
#define CKSEL1                        1327
#define MODE13                        1328
#define BIAS0                         1329
#define BIAS1                         1330
#define BIAS2                         1331
#define CPEN                          1332
#define OSCCON                        1333
#define SCS0                          1334
#define SCS                           1335
#define SCS1                          1336
#define IOFS                          1337
#define OSTS                          1338
#define IRCF                          1339
#define IRCF0                         1340
#define IRCF1                         1341
#define IRCF2                         1342
#define IDLEN                         1343
#define T0CON                         1344
#define T0PS                          1345
#define T0PS0                         1346
#define T0PS1                         1347
#define T0PS2                         1348
#define PSA                           1349
#define T0PS3                         1350
#define T0SE                          1351
#define T0CS                          1352
#define T08BIT                        1353
#define TMR0ON                        1354
#define STATUS                        1355
#define C                             1356
#define CARRY                         1357
#define DC                            1358
#define ZERO                          1359
#define Z                             1360
#define OV                            1361
#define OVERFLOW                      1362
#define N                             1363
#define NEGATIVE                      1364
#define INTCON3                       1365
#define INT1IF                        1366
#define INT1F                         1367
#define INT2IF                        1368
#define INT2F                         1369
#define INT3F                         1370
#define INT3IF                        1371
#define INT1E                         1372
#define INT1IE                        1373
#define INT2IE                        1374
#define INT2E                         1375
#define INT3E                         1376
#define INT3IE                        1377
#define INT1P                         1378
#define INT1IP                        1379
#define INT2IP                        1380
#define INT2P                         1381
#define INTCON2                       1382
#define RBIP                          1383
#define INT3IP                        1384
#define INT3P                         1385
#define TMR0IP                        1386
#define T0IP                          1387
#define INTEDG3                       1388
#define INTEDG2                       1389
#define INTEDG1                       1390
#define INTEDG0                       1391
#define RBPU                          1392
#define NOT_RBPU                      1393
#define nRBPU                         1394
#define INTCON                        1395
#define RBIF                          1396
#define INT0F                         1397
#define INT0IF                        1398
#define T0IF                          1399
#define TMR0IF                        1400
#define RBIE                          1401
#define INT0E                         1402
#define INT0IE                        1403
#define T0IE                          1404
#define TMR0IE                        1405
#define PEIE                          1406
#define PEIE_GIEL                     1407
#define GIEL                          1408
#define GIE_GIEH                      1409
#define GIE                           1410
#define GIEH                          1411
#define SP0                           1412
#define STKPTR                        1413
#define STKPTR0                       1414
#define SP1                           1415
#define STKPTR1                       1416
#define STKPTR2                       1417
#define SP2                           1418
#define SP3                           1419
#define STKPTR3                       1420
#define STKPTR4                       1421
#define SP4                           1422
#define STKUNF                        1423
#define STKOVF                        1424
#define STKFUL                        1425

#endif // _PIC18F64J90_H_
